<template>
  <div>
    <el-card>
      近年来，随着越来越多的组织与机构积极参与数据湖开源数据集的建设，数据资源的可获得性显著提升。然而，如何高效利用这些海量而多样化的数据资源以支持相关人员的深入数据分析与挖掘，仍然面临诸多挑战。本科毕业设计旨在构建一个针对数据湖环境的表格增强系统，以提高下游数据科学任务的性能表现。主要任务内容包括以下几个方面：
      相关表发现模块的设计与实现：研究基于预训练语言模型的表格语义分析方法，设计并实现能够识别表格语义相关性的算法，以支持对可联合（Union）和可连接（Join）表的高效发现。
      相关表集成模块的设计与实现：针对已发现的相关表，结合用户需求设计灵活的表格集成算法，实现多种表格集成策略并确保与原始表的无缝融合。
      原型系统的开发与实现：开发具备高度可扩展性和模块化特性的原型系统，实现算法即插即用，提供用户友好的交互界面以支持灵活定义表格增强方式，同时集成若干常见的下游数据科学任务（如分类和预测）供用户测试与验证。
      本系统旨在针对用户输入的原始表格，从数据湖中自动发现并集成其相关表格，构建增强后的表格数据，从而提升原始表格在多种下游数据科学任务中的表现能力，同时为用户提供高效、便捷的操作体验。
    </el-card>
  </div>
</template>

<script lang="ts">
export default {
  name: "Home",
};
</script>

<script setup lang="ts"></script>

<style scoped lang="scss"></style>
